app/views/projects/show.html.erb


<% @project.contracts.each do |p| %>
---
SELECT "contracts".* FROM "contracts" WHERE "contracts"."project_id" = ?  [["project_id", 1]]