app/controllers/contracts_controller.rb

SELECT "contracts".* FROM "contracts"
---
  def index
    @contracts = Contract.all

INSERT INTO "contracts" ("ctitle", "cproduct", "cservice", "cimplement", "cprogram", "cthird", "ckingdee", "cmemo", "cbegin", "cend", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @contract = @project.contracts.build(contract_params)

    respond_to do |format|
      if @contract.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_project
      @project = Project.find params[:project_id]