app/controllers/projects_controller.rb

INSERT INTO "projects" ("ptitle", "pcustom", "ptype", "pprice", "psales", "psource", "pstate", "pdate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save